#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	int a = 5;
//	//00000000000000000000000000000101 - 原码
//	//00000000000000000000000000000101 - 反码
//	//00000000000000000000000000000101 - 补码
//
//	int b = -5;
//	//00000000000000000000000000000101 - 原码
//	//11111111111111111111111111111010 - 反码
//	//1111 1111 1111 1111 1111 1111 1111 1011 - 补码
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = a << 1;
//	printf("a = %d\n", a);
//	printf("b = %d\n", b);
//	return 0;
//}
//右移操作符

/*
* 1.逻辑右移: 左边用0填充，右边丢弃
* 2.算术右移: 左边用原该值的符号位填充，右边丢弃
*/

// && - 逻辑与(并且)
// || - 逻辑或

//int main()
//{
//	int a = 5;
//	int b = -6;
//
//	int c = a & b; //按位与 - 对应的二进制位，有0则为0，两个同时为1才是1
//	c = a | b; //按位或 - 对应的二进制位，有1则为1，两个同时为0才是0
//	c = a ^ b; //按位异或 - 对应的二进制位，有1则为1，两个同时为0才是0
//	// 0000 0000 0000 0000 0000 0000 0000 0101
//	// 0000 0000 0000 0000 0000 0000 0000 0110
//	// 1111 1111 1111 1111 1111 1111 1111 1001
//	// 1111 1111 1111 1111 1111 1111 1111 1010
//	printf("%d\n", c);
//	return 0;
//}
// 异或是支持交换律的

//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前: a=%d b=%d\n", a, b);
//
//	a = a ^ b;
//
//
//	printf("交换后: a=%d b=%d\n", a, b);
//	return 0;
//}


//int main()
//{
//	int a = 15;
//	// 1 1 1 1
//	// 8 4 2 1
//	// 15%2 = 1
//	// 15/2 = 7
//	// 1 1 1
//	// 7%2 = 1
//	int count = 0;
//	while (a)
//	{
//		if (a % 2 == 1)
//		{
//			count++;
//		}
//		a = a / 2;
//	}
//	printf("count = %d\n", count);
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((a >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	printf("%d\n", count);
//	return 0;
//}

//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int count = 0;
//	while (n)
//	{
//		n = n & (n - 1);
//		count++;
//	}
//	printf("%d\n", count);
//	return 0;
//}

//~ -> 按位取反操作符(二进制是0的变成1，是1的变成0)


//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	if ((n & (n - 1)) == 0)
//	{
//		printf("yes\n");
//	}
//	else
//	{
//		printf("no\n");
//	}
//	return 0;
//}

//int main()
//{
//	int n = 0;
//	int a = ~n ;//按位取反
//	//
//	//0000000000000000
//	//1111111111111111
//	//
//	printf("%d\n", a);
//	return 0;
//}


int main()
{
	int a = 13;
	//0000 0000 0000 0000 0000 0000 0000 1101
	//0000 0000 0000 0000 0000 0000 0001 0000
	//1<<4
	//将a的二进制中第五位改成1
	a = a | (1 << 4);
	printf("a = %d\n", a);
	//将a的二进制中第五位改成0
	//0000 0000 0000 0000 0000 0000 0001 1101
	//1111 1111 1111 1111 1111 1111 1110 1111
	//
	a = a & ~(1 << 4);
	printf("a = %d\n", a);
	return 0;
}